### staging environment
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 1s
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=ffab38df-cddf-433f-859a-6cfa161a5ceb-4b7cd4a0-3d17-4a05-83e9-74b124c3214d-6b97a0e3-d398-4bbf-b2fc-6ccfe1748d3e]
data.azurerm_container_registry.main: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjdjZDRhMC0zZDE3LTRhMDUtODNlOS03NGIxMjRjMzIxNGQ7b2JqZWN0SWQ9NmI5N2EwZTMtZDM5OC00YmJmLWIyZmMtNmNjZmUxNzQ4ZDNlO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azuread_group.sql_server_admins will be created
  + resource "azuread_group" "sql_server_admins" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "SQL Server Admins for Server sql-tshort-stage-westeurope-001"
      + display_name                   = "SQL-Admins-sql-tshort-stage-westeurope-001"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "6b97a0e3-d398-4bbf-b2fc-6ccfe1748d3e",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "westeurope"
      + name                                = "appi-tshort-stage-westeurope-001"
      + resource_group_name                 = "rg-tshort-stage-westeurope-001"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + workspace_id                        = (known after apply)
    }

  # azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "cae-tshort-stage-westeurope-001"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-tshort-stage-westeurope-001"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + zone_redundancy_enabled          = false

      + workload_profile {
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "westeurope"
      + name                            = "log-tshort-stage-westeurope-001"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-tshort-stage-westeurope-001"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 1
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-tshort"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_firewall_rule.main will be created
  + resource "azurerm_mssql_firewall_rule" "main" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                      = (known after apply)
      + administrator_login_password_wo          = (write-only attribute)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "westeurope"
      + minimum_tls_version                      = "1.2"
      + name                                     = "sql-tshort-stage-westeurope-001"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-tshort-stage-westeurope-001"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + version                                  = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = true
          + login_username              = "SQL-Admins-sql-tshort-stage-westeurope-001"
          + object_id                   = (known after apply)
          + tenant_id                   = (known after apply)
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-tshort-stage-westeurope-001"
      + tags     = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_static_web_app.main will be created
  + resource "azurerm_static_web_app" "main" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "westeurope"
      + name                               = "stapp-tshort-stage-001"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-tshort-stage-westeurope-001"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_static_web_app_custom_domain.primary will be created
  + resource "azurerm_static_web_app_custom_domain" "primary" {
      + domain_name       = "staging.admin.tshort.me"
      + id                = (known after apply)
      + static_web_app_id = (known after apply)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

  # azurerm_user_assigned_identity.api will be created
  + resource "azurerm_user_assigned_identity" "api" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "id-tshort-stage-westeurope-001"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-tshort-stage-westeurope-001"
      + tags                = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + tenant_id           = (known after apply)
    }

  # cloudflare_dns_record.primary will be created
  + resource "cloudflare_dns_record" "primary" {
      + comment             = "Primary domain for TShort stage Azure Static Web App"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "staging.admin"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # time_sleep.group_provisioning will be created
  + resource "time_sleep" "group_provisioning" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "display_name" = "SQL-Admins-sql-tshort-stage-westeurope-001"
          + "object_id"    = (known after apply)
        }
    }

  # time_sleep.wait_for_dns_record will be created
  + resource "time_sleep" "wait_for_dns_record" {
      + create_duration = "2m"
      + id              = (known after apply)
      + triggers        = {
          + "record" = "staging.admin.tshort.me"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ connection_string   = "Server=tcp:sql-tshort-stage-westeurope-001.database.windows.net,1433;Database=sqldb-tshort;Authentication=Active Directory Default;User ID=758b495a-fe92-496d-84b1-57ff23c3cdca;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;" -> (known after apply)
  ~ deployment_token    = (sensitive value)
  ~ sql_server_fqdn     = "sql-tshort-stage-westeurope-001.database.windows.net" -> (known after apply)
Releasing state lock. This may take a few moments...

```

</details>